; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_2 ?v2)
               (pred_4 ?v2)
               (pred_5)
               (pred_3 ?v2)
               (pred_1 ?v2 ?v3))

  (:action op_4
    :parameters (?v1)
    :precondition (and (pred_2 ?v1) (pred_4 ?v1) (pred_5))
    :effect (and (pred_3 ?v1) (not (pred_2 ?v1)) (not (pred_4 ?v1)) 
                 (not (pred_5))))

  (:action op_1
    :parameters  (?v1)
    :precondition (pred_3 ?v1)
    :effect (and (pred_2 ?v1) (pred_5) (pred_4 ?v1) 
                 (not (pred_3 ?v1))))

  (:action op_2
    :parameters  (?v1 ?v4)
    :precondition (and (pred_2 ?v4) (pred_3 ?v1))
    :effect (and (pred_5) (pred_2 ?v1) (pred_1 ?v1 ?v4)
                 (not (pred_2 ?v4)) (not (pred_3 ?v1))))

  (:action op_3
    :parameters  (?v1 ?v4)
    :precondition (and (pred_1 ?v1 ?v4) (pred_2 ?v1) (pred_5))
    :effect (and (pred_3 ?v1) (pred_2 ?v4)
                 (not (pred_1 ?v1 ?v4)) (not (pred_2 ?v1)) (not (pred_5)))))

; problem
(define (problem BW-rand-5)
(:domain blocksworld)
(:objects obj_03 obj_01 obj_02 obj_04 obj_05 )
(:init
(pred_5)
(pred_1 obj_03 obj_04)
(pred_1 obj_01 obj_02)
(pred_1 obj_02 obj_05)
(pred_1 obj_04 obj_01)
(pred_4 obj_05)
(pred_2 obj_03)
)
(:goal
(and
(pred_1 obj_03 obj_01)
(pred_4 obj_01)
(pred_1 obj_02 obj_05)
(pred_4 obj_04)
(pred_1 obj_05 obj_04))
)

(:constraints
  (sometime-before (pred_4 obj_01) (pred_1 obj_03 obj_01))
)
)

; plan
1. (op_3 obj_03 obj_04)
   deleted: (pred_1 obj_03 obj_04) (pred_2 obj_03) (pred_5)
   added: (pred_3 obj_03) (pred_2 obj_04)
   goals met: 1 of 5
2. (op_1 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_2 obj_03) (pred_5) (pred_4 obj_03)
   goals met: 1 of 5
3. (op_3 obj_04 obj_01)
   deleted: (pred_1 obj_04 obj_01) (pred_2 obj_04) (pred_5)
   added: (pred_3 obj_04) (pred_2 obj_01)
   goals met: 1 of 5
4. (op_1 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_2 obj_04) (pred_5) (pred_4 obj_04)
   goals met: 2 of 5
5. (op_3 obj_01 obj_02)
   deleted: (pred_1 obj_01 obj_02) (pred_2 obj_01) (pred_5)
   added: (pred_3 obj_01) (pred_2 obj_02)
   goals met: 2 of 5
6. (op_2 obj_01 obj_04)
   deleted: (pred_2 obj_04) (pred_3 obj_01)
   added: (pred_5) (pred_2 obj_01) (pred_1 obj_01 obj_04)
   goals met: 2 of 5
7. (op_4 obj_03)
   deleted: (pred_2 obj_03) (pred_4 obj_03) (pred_5)
   added: (pred_3 obj_03)
   goals met: 2 of 5
8. (op_2 obj_03 obj_01)
   deleted: (pred_2 obj_01) (pred_3 obj_03)
   added: (pred_5) (pred_2 obj_03) (pred_1 obj_03 obj_01)
   goals met: 3 of 5
9. (op_3 obj_02 obj_05)
   deleted: (pred_1 obj_02 obj_05) (pred_2 obj_02) (pred_5)
   added: (pred_3 obj_02) (pred_2 obj_05)
   goals met: 2 of 5
10. (op_1 obj_02)
   deleted: (pred_3 obj_02)
   added: (pred_2 obj_02) (pred_5) (pred_4 obj_02)
   goals met: 2 of 5
11. (op_4 obj_05)
   deleted: (pred_2 obj_05) (pred_4 obj_05) (pred_5)
   added: (pred_3 obj_05)
   goals met: 2 of 5
12. (op_2 obj_05 obj_02)
   deleted: (pred_2 obj_02) (pred_3 obj_05)
   added: (pred_5) (pred_2 obj_05) (pred_1 obj_05 obj_02)
   goals met: 2 of 5
13. (op_3 obj_03 obj_01)
   deleted: (pred_1 obj_03 obj_01) (pred_2 obj_03) (pred_5)
   added: (pred_3 obj_03) (pred_2 obj_01)
   goals met: 1 of 5
14. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_05) (pred_3 obj_03)
   added: (pred_5) (pred_2 obj_03) (pred_1 obj_03 obj_05)
   goals met: 1 of 5
15. (op_3 obj_01 obj_04)
   deleted: (pred_1 obj_01 obj_04) (pred_2 obj_01) (pred_5)
   added: (pred_3 obj_01) (pred_2 obj_04)
   goals met: 1 of 5
16. (op_1 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_2 obj_01) (pred_5) (pred_4 obj_01)
   goals met: 2 of 5
17. (op_3 obj_03 obj_05)
   deleted: (pred_1 obj_03 obj_05) (pred_2 obj_03) (pred_5)
   added: (pred_3 obj_03) (pred_2 obj_05)
   goals met: 2 of 5
18. (op_2 obj_03 obj_01)
   deleted: (pred_2 obj_01) (pred_3 obj_03)
   added: (pred_5) (pred_2 obj_03) (pred_1 obj_03 obj_01)
   goals met: 3 of 5
19. (op_3 obj_05 obj_02)
   deleted: (pred_1 obj_05 obj_02) (pred_2 obj_05) (pred_5)
   added: (pred_3 obj_05) (pred_2 obj_02)
   goals met: 3 of 5
20. (op_2 obj_05 obj_04)
   deleted: (pred_2 obj_04) (pred_3 obj_05)
   added: (pred_5) (pred_2 obj_05) (pred_1 obj_05 obj_04)
   goals met: 4 of 5
21. (op_4 obj_02)
   deleted: (pred_2 obj_02) (pred_4 obj_02) (pred_5)
   added: (pred_3 obj_02)
   goals met: 4 of 5
22. (op_2 obj_02 obj_05)
   deleted: (pred_2 obj_05) (pred_3 obj_02)
   added: (pred_5) (pred_2 obj_02) (pred_1 obj_02 obj_05)
   goals met: 5 of 5
